{
  "backend/main.mo": "Motoko canister managing comic entries with create, list, and fetch-by-id functions stored in an in‑memory Set.",
  "feature_evidence.json": "Feature evidence report linking a footer background color update to its related file, components, and test ID.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose across layout, pages, hooks, styles, and config.",
  "frontend/index.css": "Tailwind base and theme variables configuring OKLCH color tokens for light and dark modes with global styling.",
  "frontend/index.html": "HTML shell defining metadata and loading the React app root and main script.",
  "frontend/src/App.tsx": "Main React app configuring routes, layout, theming, and global toaster notifications.",
  "frontend/src/components/comics/ComicCard.tsx": "Comic preview card showing image, metadata, and truncated text with navigation to detail view.",
  "frontend/src/components/layout/Footer.tsx": "White‑background footer showing attribution and styled banana‑themed branding.",
  "frontend/src/components/layout/Header.tsx": "Sticky banana‑themed header with logo, navigation, and responsive mobile menu.",
  "frontend/src/hooks/comics/useComicEntries.ts": "React Query hook fetching the full list of comic entries from the backend.",
  "frontend/src/hooks/comics/useComicEntry.ts": "React Query hook retrieving a single comic entry by its ID with error handling.",
  "frontend/src/hooks/comics/useCreateComicEntry.ts": "Mutation hook creating new comic entries and invalidating cached lists.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refetching queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth context handling login, stored identities, and status management for the app.",
  "frontend/src/index.css": "Defines global styling, Tailwind layers, and a banana-themed color palette with custom shadows and fonts.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, rendering the root App component.",
  "frontend/src/pages/BrowseComicsPage.tsx": "Fetches and displays a searchable, filterable, and sortable list of comic entries with error handling and UI controls.",
  "frontend/src/pages/ComicDetailPage.tsx": "Shows detailed information for a single comic entry with loading, error states, and navigation back to browsing.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section and calls to action for browsing or submitting comics.",
  "frontend/src/pages/SubmitComicPage.tsx": "Provides a form for submitting a new comic entry with validation, submission handling, and success feedback.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom banana-themed colors, fonts, shadows, and plugin integrations.",
  "project_state.json": "Contains project metadata, a high‑level app summary, and a list of existing feature definitions with IDs, descriptions, synonyms, and versions for the Banana IC web app."
}